TilenTinta/Amon_Board/Firmware/Amon_board_firmware-STM32H743/Core/Inc/PWM.h
/*****************************************************************
 * File Name          : Servo.h
 * Author             : Tinta T.
 * Version            : V1.0.0
 * Date               : 2023/02/23
 * Description        : Servo motor definitions
*****************************************************************/

#ifndef SERVO_SERVO_H_
#define SERVO_SERVO_H_

#include "stm32h7xx_hal.h"					// For PWM
#include "drone_data.h"
#include "math.h"


/*###########################################################################################################################################################*/
/* Defines */

/*
 * PWM: 50Hz (20ms)
 *  - DutyCycle: 0deg - 0.5ms		(1518)
 *  - DutyCycle: 90deg - 1.5ms		(4555)
 *  - DutyCycle: 180deg - 2.5ms		(7592)
 *
 * 	1deg = 0.011ms
 * 	1deg = 33.4 value
 * 	0.1deg = 3.374 value
 *
 */

// Offsets on motor to make them straight
#define SERVO_XP_OFFSET 	0		// Servo offset
#define SERVO_XN_OFFSET 	6		// Servo offset
#define SERVO_YP_OFFSET 	3		// Servo offset
#define SERVO_YN_OFFSET 	-13		// Servo offset

#define SERVOS_ZERO			90		// Zero position of servos (straight down)

// Servo slew-rates
#define SERVO_MIN_US 		1000	// Minimum duty-cycle of EDF (0%)
#define SERVO_MAX_US 		2000	// Maximum duty-cycle of EDF (100%)
#define SERVO_RANGE_US 		(SERVO_MAX_US - SERVO_MIN_US)
#define SERVO_MAX_SLEW_DEG_PER_S   375.0f // Servo used: MG995 (Operating speed: 0.2s/60deg (4.8 V), 0.16s/60deg (6 V) -> 375deg/s)
#define SERVO_MAX_STEP_DEG         (SERVO_MAX_SLEW_DEG_PER_S * TIM_50HZ_DT)  // per 20ms cycle


// EDF ramp-up parameters
#define RAMPUP_TARGET_PERC	50		// Ramp-up percent target
#define RAMPUP_TIME_MS		3000	// Ramp-up time target
#define RAMPUP_TIME_STEP_MS	20		// Ramp-up timer period of function call

// EDF warm-up parameters
#define WARMUP_TIME			3
#define WARMUP_POWER		50



/*###########################################################################################################################################################*/
/* Enums */

typedef enum {
	SERVO_XP,
	SERVO_XN,
	SERVO_YP,
	SERVO_YN,
	PWM_EDF
}e_servo;


/*###########################################################################################################################################################*/
/* Functions */

float SlewLimit(float target, float previous, float max_step);
void DegresToCCR(float degrees, uint8_t Servo);
void PowerToPWMValue(uint8_t power);
void EDFSlowRamp(s_actuators *actuators);
void EDFWarmUp(s_actuators *actuators);


#endif /* SERVO_SERVO_H_ */
